; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v4 - type_1 ?v3 - type_3)
 	      (pred_3 ?v7 - object ?v3 - type_3)
	      (pred_4 ?v4 - type_1 ?v8 - type_2)
	      (pred_2 ?v4 - type_1 ?v7 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v4 - type_1 ?v1 ?v2 - type_3)
       :precondition (and  (pred_1 ?v4 ?v1))
       :effect (and  (pred_1 ?v4 ?v2)
		     (not (pred_1 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_1 ?v6 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v5) (pred_1 ?v4 ?v5) (pred_4 ?v4 ?v8))
       :effect (and (pred_2 ?v4 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v5)) 
		    (not (pred_4 ?v4 ?v8))))

   (:action op_3
       :parameters (?v4 - type_1 ?v6 - object ?v5 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v6 ?v8) (pred_1 ?v4 ?v5))
       :effect (and (pred_3 ?v6 ?v5)
		    (pred_4 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_01 - type_1
obj_12 obj_10 obj_08 obj_07 - type_2
obj_04 obj_05 obj_02 obj_11 - type_3
obj_06 obj_13 obj_03 - object)
(:init
(pred_1 obj_09 obj_11)
(pred_4 obj_09 obj_12)
(pred_4 obj_09 obj_10)
(pred_1 obj_01 obj_11)
(pred_4 obj_01 obj_08)
(pred_4 obj_01 obj_07)
(pred_3 obj_06 obj_05)
(pred_3 obj_13 obj_02)
(pred_3 obj_03 obj_02)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_13 obj_05)
(pred_3 obj_03 obj_11)
)
)

(:constraints
  (always (not (pred_1 obj_09 obj_02)))
)
)

; plan
1. (op_1 obj_01 obj_11 obj_05)
   deleted: (pred_1 obj_01 obj_11)
   added: (pred_1 obj_01 obj_05)
   goals met: 0 of 3
2. (op_2 obj_01 obj_06 obj_05 obj_07)
   deleted: (pred_3 obj_06 obj_05) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_06 obj_07)
   goals met: 0 of 3
3. (op_1 obj_01 obj_05 obj_02)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_02)
   goals met: 0 of 3
4. (op_3 obj_01 obj_06 obj_02 obj_07)
   deleted: (pred_2 obj_01 obj_06 obj_07)
   added: (pred_3 obj_06 obj_02) (pred_4 obj_01 obj_07)
   goals met: 1 of 3
5. (op_2 obj_01 obj_13 obj_02 obj_07)
   deleted: (pred_3 obj_13 obj_02) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_13 obj_07)
   goals met: 1 of 3
6. (op_1 obj_01 obj_02 obj_05)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_05)
   goals met: 1 of 3
7. (op_3 obj_01 obj_13 obj_05 obj_07)
   deleted: (pred_2 obj_01 obj_13 obj_07)
   added: (pred_3 obj_13 obj_05) (pred_4 obj_01 obj_07)
   goals met: 2 of 3
8. (op_1 obj_01 obj_05 obj_02)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_02)
   goals met: 2 of 3
9. (op_2 obj_01 obj_03 obj_02 obj_07)
   deleted: (pred_3 obj_03 obj_02) (pred_4 obj_01 obj_07)
   added: (pred_2 obj_01 obj_03 obj_07)
   goals met: 2 of 3
10. (op_1 obj_01 obj_02 obj_11)
   deleted: (pred_1 obj_01 obj_02)
   added: (pred_1 obj_01 obj_11)
   goals met: 2 of 3
11. (op_3 obj_01 obj_03 obj_11 obj_07)
   deleted: (pred_2 obj_01 obj_03 obj_07)
   added: (pred_3 obj_03 obj_11) (pred_4 obj_01 obj_07)
   goals met: 3 of 3
